[
  {
    "company": "Helios Interactive",
    "project":"State Farm Fishing for Premiums",
    "display": "",
    "background": "helios/SFFish.png",
    "type": "Event Activation",
    "role": "Developer: Phone Front-end",
    "tools": "Vue.js · Sockets · Mobile Development · Docker · Submodules",
    "mainimage": "/fishing.png",
    "description": "For the 2019 Boat Tour, we created the ‘Fishing for Premiums’ Mobile Experience where guests would control virtual fishing poles on dedicated mobile devices to try to virtually ‘catch’ the most fish during a timed experience. The project was built in vue.js communicating through an internal tool using sockets to a unity application. By using the phone’s gyroscope data we were able to simulate real fishing mechanics on the unity display. The phone was attached to a real fishing pole to enhance the feel of fishing.",
    "websiteLink": "",
    "gallery": ["helios/fishing/sf1.png", "helios/fishing/sf2.png", "helios/fishing/sf3.png", "helios/fishing/sf4.png", "helios/fishing/sf5.png", "helios/fishing/sf6.png", "helios/fishing/fishing.png"]
    },
    {
    "company": "Helios Interactive",
    "project": "Content Portal",
    "display": "feature",
    "background": "helios/cp.jpg",
    "type": "Event Activation / Web",
    "role": "Developer",
    "tools": "Vue.Js · SCSS · Postman · Docker · Mobile Development · MongoDB · APIs",
    "mainimage": "/cp.jpg",
    "description": "Content Portal was a product a small team focused on developing that could be used at many different types of trade shows. This followed a different process than most other projects because we had many rounds of UX/UI, user testing, and prototype tests. The idea was an application that exhibitors at a show could provide a QR code for guests to scan for more information digitally. This consisted of three parts, the CMS for exhibitors to add content and information, the front-end interface where anyone could preview and sign up, and finally the attendee portal where content would be saved and where it could be shared with others. Our first roll out was for Seatrade Cruise Global in the beginning 2019 then continued improving the application for Gartner to Go later in 2019 as well as a redeploy in 2021. In 2020 we rolled it out for our parent company Freeman for Freeman Live. Originally build in React.js and later rebuilt using Vue.js.",
    "websiteLink": "",
    "gallery": ["helios/contentPortal/cp1.png","helios/contentPortal/cp2.png", "helios/contentPortal/cp3.png", "helios/contentPortal/cp4.jpg"]
  },
  {
    "company": "Helios Interactive",
    "project": "Detroit Lions LPO",
    "display": "",
    "background": "helios/detroitLions.jpg",
    "type": "Event Activation",
    "role": "Developer",
    "tools": "React.js · APIs · Submodules",
    "mainimage": "/detroitLions.jpg",
    "description": "For the 2018 football season we deployed a “Legendary Photo Op” experience for fans of the Detroit Lions at Ford Field in Detroit, MI. The activation utilized a Unity application to have guests take a photo with their choice of player as if the player were standing right beside them. The guest would then head over to our web application kiosk built in React.Js where they would be able to select their photo to share with themselves and on social media.",
    "websiteLink": "",
    "gallery": ["helios/detroitLions/DL1.jpg", "helios/detroitLions/DL2.png", "helios/detroitLions/DL3.png", "helios/detroitLions/DL4.png", "helios/detroitLions/DL5.png", "helios/detroitLions/DL6.png"]
  },  
  {
    "company": "Helios Interactive",
    "project": "Druva Leaderboard",
    "display": "",
    "background": "helios/Druva.png",
    "type": "Event Activation",
    "role": "Support Developer - Leaderboard",
    "tools": "Vue.js · Submodules · APIs",
    "mainimage": "/Druva.png",
    "description": "We created a kinect interactive game for Druva, in partnership with FreemanXP, for VM World Las Vegas in Aug 2018. The experience consisted of a gesture-based game that allowed users to ‘climb’ a mountain, using hand driven climbing and grabbing gesture.  The experience was a ‘race to the top’ - allowing the participant the ability to progress through the experience as they collected ‘data’. Users were judged on their performance throughout the experience, and ended by adding their initials to a leaderboard that would show how they performed vs. others at the event. The leaderboard was build using Vue.js and displayed in the middle of the installation space.",
    "websiteLink": "",
    "gallery": ["helios/druva/DM1.png", "helios/druva/DM2.jpg", "helios/druva/DM3.png", "helios/druva/DM4.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "Splunk Keynotes 2018",
    "display": "",
    "background": "helios/Splunk.png",
    "type": "Event Activation",
    "role": "Web Developer / Support Developer / Client Metrics Developer ",
    "tools":"Vue.js  · Sockets · Splunk Metrics Tools  · Data Anaylizing",
    "mainimage": "/Splunk.png",
    "description": "For the Splunk Conf 2018 Helios provided two different keynote experiences over the course of their conference. There was a horse racing game and a name submition visualizer. Guests in the auidence would use their phone to access the experience that day. On the horse race day guests would select their horse team based on the section of the conference they were sitting in. When the race started they would shake their phone to make their horse run faster which was based on the gyroscope data getting sent. The winning horse was the one that had gotten the most averaged participation. On the name visualizer day guests selected a color and input their name. When they submitted it they would see their name appear on the large screen and animate to join the rest of the names that had been submitted. Both applications consisted of a phone portion built in Vue.js that communicated using sockets to a unity visualizer. When the conference was over we also took the data from the event based on participation and any downtime and anaylized it to note how successful a full audience contribution was in a live event.",
    "websiteLink": "",
    "gallery": ["helios/splunk/spl1.png","helios/splunk/spl2.jpg","helios/splunk/spl3.jpg","helios/splunk/spl4.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "Under Armour Thermal Photo",
    "display": "",
    "background": "helios/underArmour.jpg",
    "type": "Event Activation / Photo Experience ",
    "role": "Developer",
    "tools": " Vue.js · APIs · SCSS",
    "mainimage": "/underArmour.jpg",
    "description": "We created a photo opportunity for Under Armour events for IMG Live in November 2018 in Chicago. The experience had guest take a side-by-side photo of themselves (regular and thermal image) and then select a frame to go around their photo. They were then able to send it to themselves and share it on social media. The whole photo experience was build in Vue.js and worked with RFID scanners.",
    "websiteLink": "",
    "gallery": ["helios/underArmour/UA1.png", "helios/underArmour/UA2.png", "helios/underArmour/UA3.png", "helios/underArmour/UA4.png", "helios/underArmour/UA5.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "Bank of the West Paribas Open 2018",
    "display": "",
    "background": "helios/botw.png",
    "type": "Event Activation / Photo Experience ",
    "role": "Lead Developer",
    "tools": "React.js · APIs",
    "mainimage": "/botw.png",
    "description": "For the BNP Paribas Open in Indian Wells, March 2020 we deployed a “Legendary Photo Op” experience where guests were able to choose one of 5 tennis players or 'Change Makers' known for their contributions to the sport to take a photo with. The activation utilized a Unity application for the photo as if the player/”Change Maker” were standing right beside them. The guest would then head over to our web application kiosk built in React.Js where they would be able to select their photo to share with themselves and on social media.",
    "websiteLink": "",
    "gallery": ["helios/botw/botw1.png", "helios/botw/botw2.png", "helios/botw/botw3.png", "helios/botw/botw4.png", "helios/botw/botw5.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "Stratasys Virtual Booth",
    "display": "",
    "background": "helios/stratasys.png",
    "type": "Web",
    "role": "Support Developer",
    "tools": "React.JS · Video Players",
    "mainimage": "/stratasys.png",
    "description": "We built a custom website for Stratasys to support the virtual product launch in April 2020. The website included a gated Log-In Page, a Launch Video released at a specific time and date, chat feature for guests during the video launch, chat support, and the homepage which displayed their “Design Studio” environment. In the “Design Studio” there were a total of 7 hotspots with information, images, and/or videos. The entire site was built in Vue.js.",
    "websiteLink": "https://www.experiencestratasys.com/",
    "gallery": ["helios/stratasys/strat1.png", "helios/stratasys/strat2.png", "helios/stratasys/strat3.png", "helios/stratasys/strat4.png", "helios/stratasys/strat5.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "SAP Sapphire Chocolate Shop",
    "display": "",
    "background": "helios/sap.png",
    "type": "Deployment Pipeline / Web ",
    "role": "Web Developer / Deployment Pipeline Lead ",
    "tools": "Heroku · Bitbucket Pieplines · Javascript · WebGL · Express",
    "mainimage": "/sap.png",
    "description": "We created an online interactive experience that highlighted three CX journeys for SAP, highlighting the connection between users, their decisions, and the SAP product demos in Fall of 2020.  We deployed this environment in WebGL exported from Unity with a landing page that had three different environments to explore.  The website was hosted using a pipeline from bitbucket through to Heroku for staging and final deployment. The code also involved javascript to detect specific devices, browser types, and browser resizing.",
    "websiteLink":"",
    "gallery": ["helios/sap/sap1.png", "helios/sap/sap2.png", "helios/sap/sap3.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "Deliotte Tax Interactive",
    "display": "",
    "background": "helios/deliotte.png",
    "type": "Deployment Pipeline / Web ",
    "role": "Web Developer / Deployment Pipeline Lead ",
    "tools": "Heroku · Bitbucket Pieplines · Javascript · WebGL · Express",
    "mainimage": "/deliotte.png",
    "description": "We created an online interactive experience that told a compelling story of Deloitte capabilities through a guests journey as a sales tool for their pursuit team in Fall of 2020. We deployed this environment in WebGL exported from Unity. The website was hosted using a pipeline from bitbucket through to Heroku for staging and final deployment. The code also involved javascript to detect specific devices, browser types, and browser resizing. An update was later requested for another deployment in 2021.",
    "websiteLink":"",
    "gallery": ["helios/deliotte/d1.png", "helios/deliotte/d2.png", "helios/deliotte/d3.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "Bayer Virtual Farm Progress Show",
    "display": "",
    "background": "helios/bayer.png",
    "type": "Deployment Pipeline / Web ",
    "role": "Web Developer / Deployment Pipeline Lead ",
    "tools": "Heroku · Bitbucket Pieplines · Javascript · WebGL · Express",
    "mainimage": "/bayer.png",
    "description": "We created an online interactive experience for Bayer’s Farm Progress Show in Fall 2020. The site consisted of a large white tent with different areas to explore and learn. We deployed this environment in WebGL exported from Unity. The website was hosted using a pipeline from bitbucket through to Heroku for staging and final deployment. The code also involved javascript to detect specific devices, browser types, and browser resizing.",
    "websiteLink": "",
    "gallery": ["helios/bayer/b1.png", "helios/bayer/b2.png", "helios/bayer/b3.png", "helios/bayer/b4.png", "helios/bayer/b5.png", "helios/bayer/b6.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "Choose Chicago",
    "display": "",
    "background": "helios/choosechicago.png",
    "type": "Web",
    "role": "Lead Developer",
    "tools": "360 Images · Vue.JS · Lennd CMS · Vimeo · Pannellum · Google Anaylitics · Express",
    "mainimage": "/choosechicago.png",
    "description": "We worked to develop a visually appealing story for the Virtual Safety Experience with Choose Chicago in December 2020. Showcasing Chicago’s own Airport, Transportation, Nightlife, and McCormick place through a mix of computer-generated models, 360 photographic images, and videos. Our role specifically was to tell the story of the safety measures Chicago has to offer travelers and locals alike and wrap it all into one streamlined virtual experience. We were able to do this using Vue.JS and Pannellum, a lightweight, free, and open source panorama viewer for the web which had a full discovery period prior to selling the project.",
    "websiteLink": "https://www.healthymeetingschicago.com/",
    "gallery": ["helios/chicago/CC1.png", "helios/chicago/CC2.png", "helios/chicago/CC3.png", "helios/chicago/CC4.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "Cisco Live 2021",
    "display": "",
    "background": "Helios Interactive/cisco21.png",
    "type": "Web",
    "role": "Support Developer",
    "tools": "React.JS · Lennd CMS · Google Analytics · SCSS",
    "mainimage": "/cisco21.png",
    "description": "We created and redefined the virtual Exhibit Hall for Cisco Live 2021. Exhibit booths had three unique and clearly defined levels of Exhibitors which were sold to various sponsors. Each tier displayed content that the sponsor chose ranging from videos to simple links. Our top tier was displayed as a 3D booth that rotated with hotspots. Out next tier was similar but displayed as a 2D booth and our last tier was a simple spotlight page with all of their content displayed without the visual of a physical booth. The site was built using React.js and various other integrations for registration and metrics collection.",
    "websiteLink": "",
    "gallery": ["helios/cisco21/c1.png", "helios/cisco21/c2.png", "helios/cisco21/c3.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "Cardinal Health Custom Homepage",
    "display": "",
    "background": "helios/cardinalhealth.jpg",
    "type": "Web",
    "role": "Developer",
    "tools": "React.js · Docker",
    "mainimage": "helios/cardinalhealth.jpg",
    "description": "In collaberation with the Freeman team, we worked in their software for online events to create a custom homepage specifically for Cardinal Health in April 2021. The page was integrated into their codebase and used to help highlight the points of interactivity in the virtual event in a visually appealing way. The project was based in React.Js using docker to run locally and github as version control.",
    "websiteLink": "",
    "gallery": ["helios/cardinal/c1.png", "helios/cardinal/c2.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "Spargo IMS Custom Homepage",
    "display": "",
    "background": "helios/spargo.png",
    "type": "Web",
    "role": "Lead Developer",
    "tools": "React.js · Docker",
    "mainimage": "/spargo.png",
    "description": "In collaberation with the Freeman team, we worked in their software for online events to create a custom homepage specifically for the Spargo International Myeloma Society in July 2021. The page was integrated into their codebase and used to help highlight the points of interactivity in the virtual event in a visually appealing way. The project was based in React.Js using docker to run locally and github as version control.",
    "websiteLink": "",
    "gallery": ["helios/spargo/s1.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "USBank 49ers High School Wall ReDeploy",
    "display": "",
    "background": "helios/usbank.jpg",
    "type": "Event Activation",
    "role": "Lead Developer",
    "tools": "Docker · Vue.js · Sockets · API",
    "mainimage": "/usbank.jpg",
    "description": "We took an application that was previously deployed and re-amped it for the US Bank high school sports experience at Levi's Stadium from November 2021 through January 2022. The tablet application took inputs from the guest selecting school and sport to get that specific schools wins over the past years. The data was sent to the visualizer to display on a larger screen. The tablet portion was written in Vue.js and communicated with a socket server and API.",
    "websiteLink": "",
    "gallery": ["helios/usbank/USB1.png", "helios/usbank/USB2.png", "helios/usbank/USB3.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "CrowdStrike CrowdFest Comic",
    "display": "",
    "background": "helios/crowdstrike.png",
    "type": "Web",
    "role": "Lead Developer",
    "tools": "Google Analytics · JS · CSS · HTML",
    "mainimage": "/crowdstrike.png",
    "description": "We built a standalone, single page website for Crowdstrike’s CrowdFest, accessible to guests via the SpotMe event site in December 2021. We provided a URL that was embedded into the SpotMe page. The overall experience was a comic creator. The guest would fill out a form with their name and the answers of three questions. Based on their answers a unique comic strip was generated for them to save on their device. Since this was a simple build we made the code as minimal as possible utilizing javascript, html, and css.",
    "websiteLink": "",
    "gallery": ["helios/crowdstrike/c1.png", "helios/crowdstrike/c2.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "Cisco Live 2022",
    "display": "",
    "background": "helios/cisco22.png",
    "type": "Web",
    "role": "Technical Director / Lead Developer",
    "tools": "React.JS · Lennd CMS · AWS · Google Analytics · SCSS",
    "mainimage": "/cisco22.png",
    "description": "We started the project as a deployment for 2022 Cisco Live world of Solutions digital experience, building off the successes and learnings from the 2021 Cisco Live World of Solutions Exhibit Hall. As the project progressed we pivoted to a smaller approach specifically for Cisco Live’s Digital Showcase without the sponsors. We developed a site with one 3D virtual booth with 5 hotspots each with 5 pieces of content. Utilizing Lennd for our content management system we were able to build a site and add the content as it came from the client without affecting our builds. The site was mobile responsive and built using React.Js. We also provided the client with an in depth Google Anayltics breakdown.",
    "websiteLink": "",
    "gallery": ["helios/cisco22/C1.png", "helios/cisco22/C2.png", "helios/cisco22/C3.png", "helios/cisco22/C4.png", "helios/cisco22/C5.png", "helios/cisco22/C6.png"]
  }, 
  { 
    "company": "Helios Interactive",
    "project": "Warriors Ticket Config 2022",
    "display": "",
    "background": "helios/warriors22.jpg",
    "type": "Event Activation / Photo Experience ",
    "role": "Technical Director / Lead Developer",
    "tools": "Vue.js · APIs · SCSS · Analytics",
    "mainimage": "/warriors22.jpg",
    "description": "We created a photo opportunity for The Golden State Warriors for their games through the 2022 playoff and finals season. The experience had guests take a photo of themselves and then select a frame to go around their photo. Each frame had a different style with some players from the team as well as the game attended and date. For different games there were select sponsors that could be swapped out on the title header and ticket designs. Once they finished selecting their design, they were then able to send it to themselves and share it on social media. The whole photo experience was built in Vue.js while utilizing our internal APIs, canvas, and deployed on SP4 tablets.",
    "websiteLink": "",
    "gallery": ["helios/warriors/w1.png", "helios/warriors/w2.png", "helios/warriors/w3.png", "helios/warriors/w4.png", "helios/warriors/w5.jpg"]
  },
  { 
    "company": "Helios Interactive",
    "project": "D23 Kardashians",
    "display": "",
    "background": "helios/kardashians.png",
    "type": "Event Activation / Video Experience ",
    "role": "Technical Director / Senior Developer",
    "tools": "React.js · APIs",
    "mainimage": "/kardashians.png",
    "description": "Helios created an interactive experience that allows guests to pose alongside The Kardashians on Hulu at Disney’s D23 Expo at the Anaheim Convention center in September 2022. Users were able to showcase their “fierce” walk and see themselves on screen with the Kardashian family as if they were appearing as the “Seventh Sibling” in a debut shoot. The experience consisted of two parts, the tablet and the video capture. On the tablet users tapped their RFID wristband with their registration information then the guest then moved over to the set and recorded their takeaway. The tablet was built using React.js and internal APIs to communicate with the video capture portion.",
    "websiteLink": "",
    "gallery": ["helios/kardashians/k1.png", "helios/kardashians/k2.png", "helios/kardashians/k3.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "D23 Abbott Elementary",
    "display": "feature",
    "background": "helios/abbott.png",
    "type": "Event Activation / Video Experience ",
    "role": "Technical Director / Senior Developer",
    "tools": "React.js · APIs",
    "mainimage": "/abbott.png",
    "description": "Helios created an interactive experience to transport guests into a scene of Abbott Elementary during Disney's D23 Expo at the Anaheim Convention center in September 2022. Users were able to select an Abbott Elementary scene of their choice, then step on a fabricated set to see themselves in that scene! The experience consisted of two parts, the tablet and the video capture. On the tablet users tapped their RFID wristband with their registration information then selected a scene that they wanted to use for a video takeaway. The guest then moved over to the set and recorded their takeaway. The tablet was built using React.js and internal APIs to communicate with the video capture portion.",
    "websiteLink": "",
    "gallery": ["helios/abbott/a1.png", "helios/abbott/a2.png", "helios/abbott/a3.png", "helios/abbott/a4.png"]
  },
  { 
    "company": "Helios Interactive",
    "project": "Warriors Put a Ring on it 2022",
    "display": "",
    "background": "helios/paroi.png",
    "type": "Event Activation / Photo Experience ",
    "role": "Technical Director / Senior Developer",
    "tools": "Vue.js · Canvas · APIs",
    "mainimage": "/paroi.png",
    "description": "Helios created and deployed two versions of the Put a Ring on It application for the Golden State Warriors. The onsite local app went live in Thrive City and the Chase Lounge for Opening Night. The application on site allowed guests to take a picture and place championship rings from 2015, 2017, and 2018 on the photo with a blurred photo of the new 2022 ring as a teaser. The guest could resize, add, remove and drag where they wanted rings it on their picture. The experience was built in Vue.js while utilizing our internal APIs, canvas, and deployed on SP4 tablets.",
    "websiteLink": "",
    "gallery": ["helios/paroi/wp1.png", "helios/paroi/wp2.png", "helios/paroi/wp3.png", "helios/paroi/wp4.png", "helios/paroi/wp5.png", "helios/paroi/wp6.png"]
  }
]